app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
            <div class="col-sm-4 col-md-4 col-lg-4">
              <a href="<%= url_for action:"show_profile", controller: "users", username: follower.username %>" class="btn transparentButton btn-default center-block" style="margin-top:8px;margin-bottom:8px;" role="button">Show <%= follower.first_name + "'s" %> Profile <span class="glyphicon glyphicon-hand-right" aria-hidden="true"></span></a>