app/views/users/search.html.erb

SELECT "users".* FROM "users" WHERE (first_name like '%yo%' or last_name like '%yo%' or username like '%yo%')
---
      <div class="well well-lg">
            <h2><span class="glyphicon glyphicon-chevron-right" aria-hidden="true"></span> <%= user.first_name + " " + user.last_name %> <small>@<%= user.username %></small></h2>