app/views/welcome/index.html.erb

              <div class="caption">
                  <h4><span style="color:orange;"><span class="glyphicon glyphicon-picture" aria-hidden="true"></span> <%= post.image_heading %> | <span class="glyphicon glyphicon-user" aria-hidden="true"></span> <%= @users.where(id:post.user_id).to_a[0].first_name %> </span> <hr> <%= post.image_caption %></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]