app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
      if params[:format] == "json"
        begin
          @post = Post.find(params[:id])

          if @post.user_id != current_user.id
            flash[:alert] = "Invalid post."
            redirect_to posts_path
          end

          respond_to do |format|
            format.json {render json: { id: @post._id.to_s, delete_path: url_for(action: "delete", controller: "posts", deleteID: @post._id.to_s), image_caption: @post.image_caption, image_heading: @post.image_heading, image_base64: @post.image_base64, image_content_type: @post.image_content_type, time: time_ago_in_words(@post.time) } }
          end

        rescue
          flash[:alert] = "Invalid post."
          redirect_to posts_path
        end
      end

      if Post.find(params[:id]).user_id != current_user.id