app/controllers/users_controller.rb

    def show_profile
        if params[:format] == "json"
          @showUser = User.where(username: params[:username]).first
          if @showUser != nil
            @posts = []
            Post.where(user_id: @showUser.id).each do |post|
              @posts.push({image_caption: post.image_caption, image_heading: post.image_heading, image_base64: post.image_base64, image_content_type: post.image_content_type, time: time_ago_in_words(post.time) })
            end
          end

          if current_user
            if current_user.following.include? @showUser.id
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]