app/controllers/users_controller.rb

    def index
        if current_user
          @user = current_user
          @followers = []
          for followerID in current_user.followers
            @followers.push(User.find(followerID))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def follow

      @user = User.where(username: params[:username]).first
      if @user.id  == current_user.id
        redirect_to url_for action: "show_profile", controller: "users", username: @user.username
      end
      if @user.followers.include? current_user.id
      else
        @user.followers.push(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "winter.raynor"], ["LIMIT", 1]]
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "[36]"], ["updated_at", "2026-01-09 07:30:57.225455"], ["id", 35]]

    def unfollow

      @user = User.where(username: params[:username]).first

      if @user.id  == current_user.id
        redirect_to url_for action: "show_profile", controller: "users", username: @user.username
      end

      if @user.followers.include? current_user.id
        @user.followers.delete(current_user.id)
        @user.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "winter.raynor"], ["LIMIT", 1]]
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "[]"], ["updated_at", "2026-01-09 09:17:26.470348"], ["id", 1]]

    def show_profile
        @user = User.where(username: params[:username]).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "kent.larson"], ["LIMIT", 1]]

    def search
        if request.method == "POST"
          if params[:searchQuery] == ""
            flash[:alert] = "No search query entered."
            redirect_to root_path
          else
            redirect_to url_for action: "search", controller: "users", searchQuery: params[:searchQuery]
          end
        else
          if params[:searchQuery] == ""
            flash[:alert] = "No search query entered."
            redirect_to root_path
          else
            @users = User.where("first_name like ? or last_name like ? or username like ?", "%" + params[:searchQuery] + "%", "%" + params[:searchQuery] + "%", "%" + params[:searchQuery] + "%")
---
SELECT "users".* FROM "users" WHERE (first_name like ? or last_name like ? or username like ?)  [[nil, "%Raymon%"], [nil, "%Raymon%"], [nil, "%Raymon%"]]